# --- Core ---
brew "git"
brew "gh"
brew "starship"
brew "fzf"
brew "eza"
brew "zoxide"
brew "direnv"

# --- Infra ---
cask "docker-desktop"
brew "lazydocker"  # Docker TUI (Omarchy-style container management)

# --- Window manager ---
cask "aerospace"
cask "ubersicht"     # Widget platform for simple-bar

# --- Productivity ---
cask "raycast"
cask "visual-studio-code"
cask "google-chrome"
cask "cursor"
cask "claude"

# --- Audio ---
cask "blackhole-2ch"

# --- Fonts ---
cask "font-fira-code-nerd-font"

# --- Terminal Power Tools ---
brew "lazygit"   # Git UI
brew "bat"       # Cat on steroids
brew "git-delta" # Git diff viewer
brew "tldr"      # Man pages for humans
brew "btop"      # System monitor
brew "shellcheck" # Shell script linter

# --- Testing & Quality ---
brew "bats-core"   # Bash test framework

# --- Optional but recommended ---
brew "ripgrep"
brew "fd"

# --- Browser Development ---
brew "cmake"       # WebKit
brew "ninja"       # WebKit/Chromium
brew "python"      # Required for builds
brew "ccache"      # Compiler cache (Critical for C++)
brew "llvm"        # Often needed for specific builds
# NOTE: Xcode (full app) required for Chromium/WebKit. Install from App Store manually.

# --- Golang ---
# Managed by mise (abstracted)

# --- JS/TS Fullstack ---
# Node managed by mise (abstracted)
brew "pnpm"        # Package manager (God Tier)
brew "bun"         # All-in-one runtime
brew "mongosh"     # MongoDB Shell

# --- Version Management (Abstracted) ---
brew "mise"        # The "One" Manager (Node, Go, Java, Rust...)
brew "ffmpeg"      # Audio capture/processing
brew "uv"          # Fast Python package installer
brew "ollama"      # Local AI (Fastest)
